# 공지사항 데이터베이스
# 최신 공지사항이 위로 오도록 리스트의 앞쪽에 추가하세요.

NOTICE_DB = [
        {
        "date": "2026-02-11",
        "content": """
        - 260207 일자 티니핑 길드 상대로 여포, 팔라누스 등 신규 캐릭터 사용법 공격 데이터 24건, 방어 데이터 25건 업데이트 했습니다.
        - 이미 사용한 영웅을 선택하면, 해당 영웅을 제외하고 <b>현재 남은 영웅으로 공격 가능한 조합</b>만 필터링하여 보여주는 기능을 추가했습니다.<br>
        - AI를 추가해서 원하는 데이터를 얻을 수 있게 기능 추가하였습니다.
        """
    },
    {
        "date": "2026-02-04",
        "content": """
        - 날짜 필터 기본값이 <b>'모두 선택'</b>으로 변경되었습니다.
        - 260131 일자 밤빛 길드 공격 데이터 64건, 방어 데이터 84건 업데이트 했습니다.
        - <b>안내 및 소식 탭 추가</b>
        """
    },
    {
        "date": "2026-01-24",
        "content": """
        - <b>매치업 상세 가이드(Tab 2)</b> 기능이 강화되었습니다.<br>
        - 공격 덱 추천에서 <b>'📖 공략 있음'</b> 팝업 기능을 추가했습니다.<br>
        """
    },
    {
        "date": "2026-01-07",
        "content": """
        - <b>서비스 오픈!</b> 판다 길드전 공격 추천 시스템이 가동됩니다.<br>
        - 길드전 데이터를 기반으로 승률 높은 덱을 추천해 드립니다.
        """
    }
]
